Repository: Jaco1030D/servicejava
Catalog: upload-dir/segmentos-1764361250161.xlf
Languages: pt_br

# P244D057-tu1
source: Especificação da Tarefa: Componente de Edição de Segmentos
pt_br: Task Specification: Segment Editing Component

# P244D057-tu2
source: Objetivo
pt_br: Objective

# P244D057-tu3
source: Desenvolver um componente React e hooks customizados que permita a edição de segmentos de tradução, com suporte para texto e tags, de forma similar a ferramentas de tradução profissional. O sistema deve garantir a consistência das tags e oferecer uma experiência de usuário fluida.
pt_br: Develop a React component and custom hooks that allow the editing of translation segments, supporting text and tags, similar to professional translation tools.The system must ensure consistency of tags and provide a smooth user experience.

# P244D057-tu4
source: Estrutura e Dados
pt_br: Structure and Data

# P244D057-tu5
source: O componente deve consumir dados de um contexto (Context API). Aquele contexto que você criou foi feito para suporta esse componente:
pt_br: The component must consume data from a context (Context API).That context you created was made to support this component:

# P244D057-tu6
source: startEditing(segmentId): Altera o status de um segmento para "em progresso".
pt_br: startEditing(segmentId): Changes the status of a segment to "in progress."Please provide the text you would like me to translate.

# P244D057-tu7
source: saveSegment(segmentId, payload): Salva as alterações de um segmento. O payload deve incluir:
pt_br: saveSegment(segmentId, payload): Saves the changes of a segment.The payload must include:

# P244D057-tu8
source: textWithTags: A string do texto editado, incluindo as tags.
pt_br: The string of the edited text, including the tags.

# P244D057-tu9
source: textWithoutTags: A string do texto editado, sem as tags.
pt_br: the string of the edited text, without the tags.

# P244D057-tu10
source: tags: Um array de tags, validado conforme as regras de negócio.
pt_br: tags: An array of tags, validated according to the business rules.

# P244D057-tu11
source: Regras de Implementação
pt_br: Implementation Rules

# P244D057-tu12
source: Edição de Texto e Salvar
pt_br: Text Editing and Save

# P244D057-tu13
source: Ao clicar no campo de edição, chame a função startEditing(segmentId).
pt_br: When clicking on the editing field, call the function startEditing(segmentId).Please provide the text you would like translated.

# P244D057-tu14
source: O salvamento deve ser acionado pelo atalho de teclado Alt + Enter.
pt_br: The save must be activated by the keyboard shortcut Alt + Enter.Please provide the text you would like translated.

# P244D057-tu15
source: Quando o usuário sair do campo de edição sem salvar, uma borda vermelha deve ser exibida para indicar que há "alterações não salvas".
pt_br: When the user exits the editing field without saving, a red border should be displayed to indicate that there are "unsaved changes."

# P244D057-tu16
source: Implemente as funcionalidades de desfazer (undo) e refazer (redo) para todas as ações no campo de edição.
pt_br: Implement the undo and redo functionalities for all actions in the editing field.

# P244D057-tu17
source: Gerenciamento e Validação de Tags
pt_br: Tag Management and Validation

# P244D057-tu18
source: As tags devem ser exibidas visualmente no campo de edição como
pt_br: Tags should be visually displayed in the editing field as

# P244D057-tu19
source: placeholders unitários (por exemplo, (1)), que o usuário pode inserir e remover.
pt_br: single placeholders (for example, (1)), which the user can insert and remove.Please provide the text you would like me to translate.

# P244D057-tu20
source: Ao apagar um placeholder, ele deve ser removido por completo, como um único token, em vez de caractere por caractere.
pt_br: When deleting a placeholder, it should be removed completely, as a single token, instead of character by character.

# P244D057-tu21
source: O sistema deve implementar atalhos de teclado (como Alt + Número) para a inserção rápida de tags.
pt_br: The system should implement keyboard shortcuts (such as Alt + Number) for quick tag insertion.Please provide the text you would like me to translate.

# P244D057-tu22
source: As seguintes regras de consistência para as tags devem ser validadas durante o salvamento:
pt_br: The following consistency rules for the tags must be validated during saving:

# P244D057-tu23
source: Quantidade de tags: O número de tags no segmento de destino (target) não pode ser maior do que no segmento de origem (source).
pt_br: Number of tags: The number of tags in the target segment cannot be greater than in the source segment.Please provide the text you would like me to translate.

# P244D057-tu24
source: Tags ausentes: Se faltarem tags no segmento de destino em relação ao segmento de origem, um erro deve ser exibido ao tentar salvar.
pt_br: Missing tags: If tags are missing in the target segment compared to the source segment, an error should be displayed when trying to save.

# P244D057-tu25
source: Tags não fechadas: O sistema deve detectar tags que foram abertas,
pt_br: Unclosed tags: The system must detect tags that have been opened,

# P244D057-tu26
source: mas não fechadas, e fornecer um feedback visual (por exemplo, cor vermelha) para o usuário.
pt_br: but not closed, and provide visual feedback (for example, red color) to the user.Please provide the text you want to be translated.

# P244D057-tu27
source: Colaboração em Tempo Real
pt_br: Real-Time Collaboration

# P244D057-tu28
source: O sistema deve estar preparado para receber uma mensagem via WebSocket informando o id de um segmento que está sendo editado por outro usuário.
pt_br: The system must be prepared to receive a message via WebSocket informing the id of a segment that is being edited by another user.

# P244D057-tu29
source: Quando essa mensagem for recebida, o componente deve bloquear a edição do segmento correspondente, impedindo que o usuário o modifique.
pt_br: When this message is received, the component should block editing of the corresponding segment, preventing the user from modifying it.

# P244D057-tu30
source: Isso deve ser feito pelo estado em redux
pt_br: This must be done by the state in redux.

# P244D057-tu31
source: Requisitos Técnicos
pt_br: Technical Requirements

# P244D057-tu32
source: Divida o código em componentes menores e hooks customizados para melhorar a modularidade, reutilização e manutenção.
pt_br: Split the code into smaller components and custom hooks to improve modularity, reusability, and maintenance.

# P244D057-tu33
source: O código deve ser limpo e organizado, sem variáveis ou hooks não utilizados.
pt_br: The code must be clean and organized, with no unused variables or hooks.

# P244D057-tu34
source: Utilize tipagens explícitas (por exemplo, com TypeScript) em vez de any para garantir a confiabilidade e a clareza do código.
pt_br: Use explicit typings (for example, with TypeScript) instead of any to ensure code reliability and clarity.

# P244D057-tu35
source: Critérios de Aceitação
pt_br: Acceptance Criteria

# P244D057-tu36
source: O componente permite a edição do texto de destino (target).
pt_br: The component allows for editing the target text.Please provide the text you would like to have translated.

# P244D057-tu37
source: O atalho Alt + Enter salva o segmento e chama a função mock saveSegment corretamente.
pt_br: The shortcut Alt + Enter saves the segment and correctly calls the mock function saveSegment.Please provide the text you would like me to translate.

# P244D057-tu38
source: As tags são exibidas como placeholders unitários e a inserção/remoção por atalhos de teclado funciona conforme especificado.
pt_br: Tags are displayed as single placeholders, and insertion/removal via keyboard shortcuts works as specified.

# P244D057-tu39
source: O sistema fornece feedback visual claro para:
pt_br: The system provides clear visual feedback for:

# P244D057-tu40
source: Alterações não salvas (borda vermelha).
pt_br: Unsaved changes (red border).

# P244D057-tu41
source: Tags incorretas ou faltando.
pt_br: Incorrect or missing tags.Please provide the text you would like me to translate.

# P244D057-tu42
source: Outros erros de consistência.
pt_br: Other consistency errors.

# P244D057-tu43
source: As funcionalidades de undo e redo estão implementadas e funcionando corretamente.
pt_br: The undo and redo functionalities are implemented and working correctly.Please provide the text you would like to have translated.

# P244D057-tu44
source: O código é modular, bem-tipado e fácil de ler.
pt_br: The code is modular, well-typed, and easy to read.Please provide the text you would like to have translated.

# P244D057-tu45
source: O segmento é bloqueado para edição quando o estado do componente recebe a informação via WebSocket de que outro usuário está editando-o.
pt_br: The segment is locked for editing when the component state receives information via WebSocket that another user is editing it.Please provide the text you would like me to translate to English (USA).
