[ {
  "id" : "P244D057-tu1",
  "source" : "Criando nova oportunidade",
  "target" : "Creating new opportunity"
}, {
  "id" : "P244D057-tu2",
  "source" : "Por que devemos criar nova oportunidade?",
  "target" : "Why should we create new opportunity?"
}, {
  "id" : "P244D057-tu3",
  "source" : "A outra opção que temos é oferecer uma melhora de algum produto existente, eis alguns exemplos:",
  "target" : "The other option we have is to offer an improvement of an existing product, here are some examples:"
}, {
  "id" : "P244D057-tu4",
  "source" : "Melhor gestão de trafego",
  "target" : "Better traffic management"
}, {
  "id" : "P244D057-tu5",
  "source" : "Melhor social media",
  "target" : "Best social media"
}, {
  "id" : "P244D057-tu6",
  "source" : "Melhor designer",
  "target" : "Best designer"
}, {
  "id" : "P244D057-tu7",
  "source" : "Melhor dentista",
  "target" : "Best dentist"
}, {
  "id" : "P244D057-tu8",
  "source" : "Melhor medico",
  "target" : "Best doctor"
}, {
  "id" : "P244D057-tu9",
  "source" : "O problema disso é 2:1. Briga por preço baixo.Quando existem diversos profissionais oferecendo um serviço ou produto tendemos a escolher o preço mais baixo, com isso acabamos entrando numa briga perigosa: cada vez diminuirmos mais e mais nossa margem de lucro.",
  "target" : "The problem with this is 2:1. A fight for low prices. When there are several professionals offering a service or product, we tend to choose the lowest price, which leads us into a dangerous fight: we keep reducing our profit margin more and more."
}, {
  "id" : "P244D057-tu10",
  "source" : "“Se não pode ser o mais barato, seja o mais caro”",
  "target" : "“If you can’t be the cheapest, be the most expensive.”"
}, {
  "id" : "P244D057-tu11",
  "source" : "2. Ego da pessoa:",
  "target" : "2. The person's ego:"
}, {
  "id" : "P244D057-tu12",
  "source" : "Essa pessoa já tentou outra solução, se você esta somente oferecendo uma melhoria significa que ela foi incompetente por não conseguir usar sem sua melhoria, isso fere o ego, péssimo começo",
  "target" : "This person has already tried another solution; if you are only offering an improvement, it means they were incompetent for not being able to use it without your improvement, which hurts the ego—terrible start."
}, {
  "id" : "P244D057-tu13",
  "source" : "“As pessoas gostam de quem justifica seus erros, acalma seus medos, apoia seus sonhos, confirma suspeitas e atacam seus inimigos”",
  "target" : "\"People like those who justify their mistakes, calm their fears, support their dreams, confirm suspicions, and attack their enemies.\""
}, {
  "id" : "P244D057-tu14",
  "source" : "Já sabemos porque não podemos melhorar, agora vamos saber por que devemos criar:Como dito acima as pessoas valorizam seu proprio ego, mesmo que indiretamente, se as pessoas fossem bondosas e pensassem no bem social acima de tudo Jesus não precisaria ter vindo.",
  "target" : "We already know why we cannot improve, now let's understand why we must create: As mentioned above, people value their own ego, even if indirectly. If people were kind and thought of social good above all, Jesus would not have needed to come."
}, {
  "id" : "P244D057-tu15",
  "source" : "Vamos continuar se baseando no ego, mas mudando a conjectura com o qual o empregamos, vamos trabalhar com seu braço auxiliar: status, essa é a chave de tudo para conseguirmos criar novas oportunidades:",
  "target" : "Let's continue relying on the ego, but changing the conjecture with which we employ it; let's work with its auxiliary arm: status, that is the key to everything for us to create new opportunities."
}, {
  "id" : "P244D057-tu16",
  "source" : "Cacau show não vende chocolate, vende presentes selecionados para a pessoa amada, dar algo caro para quem ama aumenta seus status",
  "target" : "Cacau Show doesn't sell chocolate, it sells selected gifts for a loved one; giving something expensive to someone you love increases your status."
}, {
  "id" : "P244D057-tu17",
  "source" : "Ferrari não vende carro, vende um comprovante de sucesso na vida",
  "target" : "Ferrari doesn't sell cars, it sells a proof of success in life."
}, {
  "id" : "P244D057-tu18",
  "source" : "Iphone não vende eletrônicos, vende status",
  "target" : "Iphone doesn't sell electronics, it sells status."
}, {
  "id" : "P244D057-tu19",
  "source" : "Uma nova oportunidade é mais empolgante, veja o caso dá cacau show, e como é novo ela não tem históricos negativos, isso só a impulsiona ainda mais para a sua oferta. Nosso principal objetivo como portadores da nova oportunidade é mostrar que o valor pago é 10 vezes mais barato que o produto oferecido",
  "target" : "A new opportunity is more exciting, take the case of Cacau Show, and since it is new it has no negative history, which only boosts it further for its offer. Our main goal as bearers of the new opportunity is to show that the price paid is 10 times cheaper than the offered product."
}, {
  "id" : "P244D057-tu20",
  "source" : "Como criar a nova oportunidade:",
  "target" : "How to create the new opportunity:"
}, {
  "id" : "P244D057-tu21",
  "source" : "Identifique o que as pessoas querem ao comprar o seu produto/serviço",
  "target" : "Identify what people want when buying your product/service."
}, {
  "id" : "P244D057-tu22",
  "source" : "Identifique os seus maiores desejos",
  "target" : "Identify your greatest desires."
}, {
  "id" : "P244D057-tu23",
  "source" : "Descubra em qual grande mercado se encaixa",
  "target" : "Discover which major market fits you."
}, {
  "id" : "P244D057-tu24",
  "source" : "Pergunte: Daqui a 3 anos o que tem que ocorrer na vida pessoal e profissional para estar feliz com o progresso?",
  "target" : "Ask: In 3 years, what needs to happen in your personal and professional life to be happy with the progress?"
}, {
  "id" : "P244D057-tu25",
  "source" : "Descubra as formas que eles já tentaram usar para ter a solução",
  "target" : "Discover the ways they have already tried to use to find the solution."
}, {
  "id" : "P244D057-tu26",
  "source" : "Descubra porque essa solução fracassou",
  "target" : "Discover why this solution failed."
}, {
  "id" : "P244D057-tu27",
  "source" : "Faça-os trocar de produto",
  "target" : "Make them exchange the product."
}, {
  "id" : "P244D057-tu28",
  "source" : "Mostre o quanto gastam e o pouco retorno que tem",
  "target" : "Show how much they spend and the little return they have."
}, {
  "id" : "P244D057-tu29",
  "source" : "Malhe outros produtos",
  "target" : "Malhe other products"
}, {
  "id" : "P244D057-tu30",
  "source" : "exima-os de culpa",
  "target" : "exempt them from blame"
}, {
  "id" : "P244D057-tu31",
  "source" : "Crie funis front-ends focados em fazer a migração de oportunidade",
  "target" : "Create front-end funnels focused on migrating opportunities."
}, {
  "id" : "P244D057-tu32",
  "source" : "Crie anúncios pensando nessas pessoas",
  "target" : "Create ads thinking about these people."
}, {
  "id" : "P244D057-tu33",
  "source" : "Com isso você fará a pessoa mudar de sub mercado, entenda mais sobre aqui: Link para meu outro artigo",
  "target" : "With this, you will make the person change sub market, understand more about it here: Link to my other article"
}, {
  "id" : "P244D057-tu34",
  "source" : "Melhore sua própria oferta",
  "target" : "Improve your own offer"
}, {
  "id" : "P244D057-tu35",
  "source" : "Conforme você for ajudando a atingirem seus objetivos os valores vão aumentando, escada de valor",
  "target" : "As you help them achieve their goals, the values will increase, a value ladder."
}, {
  "id" : "P244D057-tu36",
  "source" : "Sua escada de valor deve ter apenas 1 nova oportunidade, mais que isso as pessoas vão perder a confiança na oportunidade",
  "target" : "Your value ladder should have only 1 new opportunity; more than that, people will lose trust in the opportunity."
}, {
  "id" : "P244D057-tu37",
  "source" : "Saiba como montar sua escada de valor aqui: Link para outro arquivo",
  "target" : "Learn how to build your value ladder here: Link to another file"
} ]